Revit 2022 API
LabelUtils.GetLabelFor Method (ParameterType)
 Gets the user-visible name for a ParameterType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the GetLabelForSpec(ForgeTypeId) method instead.")]
public static string GetLabelFor(
	ParameterType paramType
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the GetLabelForSpec(ForgeTypeId) method instead.")> _
Public Shared Function GetLabelFor ( _
	paramType As ParameterType _
) As String
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the GetLabelForSpec(ForgeTypeId) method instead.")]
public:
static String^ GetLabelFor(
	ParameterType paramType
)
Parameters
paramType
Type: Autodesk.Revit.DB.ParameterType
 The ParameterType to get the user-visible name.
Remarks
 The name is obtained in the current Revit language.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when failed to get user-visible name for the input ParameterType.
See Also
LabelUtils Class
GetLabelFor Overload
Autodesk.Revit.DB Namespace